###############################################################################
# Created by write_sdc
# Sun Oct 29 17:44:17 2023
###############################################################################
current_design wb_buttons_leds
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 15.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {buttons}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[10]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[11]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[12]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[13]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[14]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[15]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[16]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[17]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[18]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[19]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[20]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[21]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[22]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[23]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[24]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[25]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[26]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[27]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[28]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[29]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[30]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[31]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[6]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[7]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[8]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_addr[9]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_cyc}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[10]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[11]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[12]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[13]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[14]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[15]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[16]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[17]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[18]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[19]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[20]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[21]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[22]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[23]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[24]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[25]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[26]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[27]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[28]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[29]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[30]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[31]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[4]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[5]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[6]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[7]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[8]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_data[9]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_stb}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {i_wb_we}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[10]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[11]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[4]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[5]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[7]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[8]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {led_enb[9]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[10]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[11]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[4]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[5]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[7]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[8]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {leds[9]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_ack}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[10]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[11]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[12]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[13]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[14]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[15]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[16]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[17]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[18]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[19]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[20]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[21]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[22]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[23]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[24]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[25]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[26]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[27]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[28]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[29]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[30]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[31]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[4]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[5]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[6]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[7]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[8]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_data[9]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {o_wb_stall}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {o_wb_ack}]
set_load -pin_load 0.0334 [get_ports {o_wb_stall}]
set_load -pin_load 0.0334 [get_ports {led_enb[11]}]
set_load -pin_load 0.0334 [get_ports {led_enb[10]}]
set_load -pin_load 0.0334 [get_ports {led_enb[9]}]
set_load -pin_load 0.0334 [get_ports {led_enb[8]}]
set_load -pin_load 0.0334 [get_ports {led_enb[7]}]
set_load -pin_load 0.0334 [get_ports {led_enb[6]}]
set_load -pin_load 0.0334 [get_ports {led_enb[5]}]
set_load -pin_load 0.0334 [get_ports {led_enb[4]}]
set_load -pin_load 0.0334 [get_ports {led_enb[3]}]
set_load -pin_load 0.0334 [get_ports {led_enb[2]}]
set_load -pin_load 0.0334 [get_ports {led_enb[1]}]
set_load -pin_load 0.0334 [get_ports {led_enb[0]}]
set_load -pin_load 0.0334 [get_ports {leds[11]}]
set_load -pin_load 0.0334 [get_ports {leds[10]}]
set_load -pin_load 0.0334 [get_ports {leds[9]}]
set_load -pin_load 0.0334 [get_ports {leds[8]}]
set_load -pin_load 0.0334 [get_ports {leds[7]}]
set_load -pin_load 0.0334 [get_ports {leds[6]}]
set_load -pin_load 0.0334 [get_ports {leds[5]}]
set_load -pin_load 0.0334 [get_ports {leds[4]}]
set_load -pin_load 0.0334 [get_ports {leds[3]}]
set_load -pin_load 0.0334 [get_ports {leds[2]}]
set_load -pin_load 0.0334 [get_ports {leds[1]}]
set_load -pin_load 0.0334 [get_ports {leds[0]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[31]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[30]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[29]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[28]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[27]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[26]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[25]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[24]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[23]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[22]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[21]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[20]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[19]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[18]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[17]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[16]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[15]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[14]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[13]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[12]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[11]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[10]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[9]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[8]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[7]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[6]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[5]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[4]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[3]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[2]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[1]}]
set_load -pin_load 0.0334 [get_ports {o_wb_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {buttons}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_cyc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
